EnKF-Training-codes/inputs/foam_base/case2/0/Fs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      Fs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0
0.00392041
0
2.48789e-05
0.0881387
0
4.948e-05
3.17769e-05
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 4.53979e-05;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
6.44965e-05
7.61525e-05
1.20223e-05
4.2426e-05
8.30315e-05
5.50275e-05
4.15483e-05
5.5029e-05
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 4.53979e-05;
    }
}


// ************************************************************************* //
