EnKF-Training-codes/inputs/foam_base/case2/0/Res
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      Res;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.708113
0.379914
0.999986
0.210179
0.99429
1
0.169381
0.925988
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.22775e-19
1.90575e-20
9.46213e-21
7.47457e-21
7.95319e-21
8.56971e-21
8.9702e-21
9.23454e-21
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.13317e-09
2.78049e-09
7.74804e-09
1.61954e-08
3.06219e-08
1.91368e-08
3.78283e-08
8.32744e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
1
1
1
1
1
1
1
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.24806e-08
8.68646e-09
2.70426e-08
9.99376e-08
5.70861e-08
4.26885e-08
9.96412e-08
1.05699e-07
...
)
;
    }
}


// ************************************************************************* //
