EnKF-Training-codes/inputs/foam_base/case2/0/Rew
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      Rew;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.707538
0.379929
0.999985
0.210179
0.994294
1
0.169381
0.925988
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.22726e-19
1.90582e-20
9.46214e-21
7.47457e-21
7.95319e-21
8.5697e-21
8.9702e-21
9.23454e-21
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.07831e-09
2.74471e-09
7.67301e-09
1.55902e-08
3.0535e-08
1.7072e-08
3.78226e-08
5.05963e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
1
1
1
1
1
1
1
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.2471e-08
4.37152e-09
2.20443e-08
3.3844e-08
3.44811e-08
6.43193e-09
6.92997e-09
3.58644e-09
...
)
;
    }
}


// ************************************************************************* //
