EnKF-Training-codes/inputs/foam_base/case2/0/nk
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      nk;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.048255
0.0533768
0.00287123
0.0534395
0.00132534
0.000579879
0.0537926
0.00113937
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.000272374;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0394168
0.0500196
0.0436172
0.0387732
0.035757
0.033626
0.0319163
0.0305868
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.000272374;
    }
}


// ************************************************************************* //
