EnKF-Training-codes/inputs/foam_base/case2/0/q2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      q2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
1
1
1
1
1
1
1
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2.84401e-14
1.38563e-11
4.37471e-11
1.85964e-09
9.14656e-09
3.73023e-08
1.18228e-07
3.24245e-07
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
