EnKF-Training-codes/inputs/foam_base/case2/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.0372322
0.0400152
0.0350359
0.0337302
0.0361941
0.036221
0.0325469
0.0315436
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0.0528229
0.0431096
0.0352008
0.0339367
0.0330364
0.0328423
0.032909
0.0328841
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.135517;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.920689
0.990661
0.887528
0.860415
0.852675
0.834084
0.832118
0.822751
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.135517;
    }
}


// ************************************************************************* //
