EnKF-Training-codes/inputs/foam_base/case2/0/xx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      xx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.00328516
0.000142819
0.00246945
3.6917e-05
0.000120014
0.001656
2.33754e-05
3.10624e-05
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.00940838;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.22324
6.38858
7.90228
14.2193
18.9121
23.4279
28.7506
33.6457
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.00940838;
    }
}


// ************************************************************************* //
