EnKF-Training-codes/inputs/foam_base/case2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    base
    {
        type            wall;
        inGroups        1(wall);
        nFaces          398;
        startFace       78307;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          78804;
        startFace       78705;
    }
    inlet
    {
        type            patch;
        nFaces          99;
        startFace       157509;
    }
    outlet
    {
        type            patch;
        nFaces          99;
        startFace       157608;
    }
    top
    {
        type            patch;
        nFaces          398;
        startFace       157707;
    }
)

// ************************************************************************* //
