EnKF-Training-codes/inputs/foam_base/case2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application      hisa;
startFrom        latestTime;
startTime        0;
stopAt           endTime;
endTime          2000;
deltaT           0.5;
writeControl     runTime;
writeInterval    1000;
purgeWrite       2;
writeFormat      ascii;
writePrecision   6;
writeCompression off;
timeFormat       fixed;
timePrecision    0;
runTimeModifiable true;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
