EnKF-Training-codes/inputs/foam_base/case2/system/forceCoeffsCompressible
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/forces/forceCoeffs.cfg"

patches             ( airfoil );

magUInf             233.621595211;
rho                 rhoInf;
rhoInf              1.48571291822;
lRef                0.3048;
Aref                0.3048;

liftDir             (-0.0403061842410544 0 0.9991873755767364);
dragDir             ( 0.9991873755767364 0 0.0403061842410544);

CofR                (0.07585 0 0);
pitchAxis           (0 1 0);

writeControl        timeStep;
writeInterval       10;
executeControl      timeStep;
executeInterval     10;

// ************************************************************************* //
